# -*- coding: UTF-8 -*-

import tushare as ts


'''
###############################################################################################################
    基础数据
        提供交易和回测所需要的基础信息，目前主要提供的是上市公司股票列表和交易日历等

        股票列表
        各交易所交易日历
        沪深股通成份股
        股票曾用名
        上市公司基本信息
        IPO新股列表
###############################################################################################################
'''
pro = ts.pro_api("e9e0569e1db5327f6668ae9e623858cad66b7d3e0a09c138c3afd551")

'''
###############################################################################################################
    股票列表:
        接口：stock_basic
        描述：获取基础信息数据，包括股票代码、名称、上市日期、退市日期等
        输入参数：
            is_hs	str	N	是否沪深港通标的，N否 H沪股通 S深股通
            list_status	str	N	上市状态： L上市 D退市 P暂停上市
            exchange	str	N	交易所 SSE上交所 SZSE深交所 HKEX港交所
###############################################################################################################
'''
def stock_basic():
    return pro.stock_basic(exchange_id='', list_status='L', fields='ts_code,symbol,name,area,industry,list_date')


'''
###############################################################################################################
    股票列表:
        接口：trade_cal
        描述：获取各大交易所交易日历数据,默认提取的是上交所
        输入参数：
            exchange	str	N	交易所 SSE上交所 SZSE深交所
            start_date	str	N	开始日期
            end_date	str	N	结束日期
            is_open	int	N	是否交易 0休市 1交易
###############################################################################################################
'''
def trade_cal():
    return pro.trade_cal(exchange='', start_date='', end_date='');


'''
###############################################################################################################
    上市公司基本信息:
        接口：stock_company
        描述：获取上市公司基础信息
        积分：用户需要至少120积分才可以调取，具体请参阅积分获取办法
        输入参数：
            exchange	str	N	交易所代码 ，SSE上交所 SZSE深交所 ，默认SSE
###############################################################################################################
'''
def stock_company():
    return pro.stock_company(exchange='SZSE', fields='ts_code,chairman,manager,secretary,reg_capital,setup_date,province');


'''
###############################################################################################################
    沪深股通成份股:
        接口：hs_const
        描述：获取沪股通、深股通成分数据
        输入参数：
            hs_type	str	Y	类型SH沪股通SZ深股通
            is_new	str	N	是否最新 1 是 0 否 (默认1)
###############################################################################################################
'''
def hs_const():
    return pro.hs_const(hs_type='SH');

'''
###############################################################################################################
    股票曾用名:
        接口：namechange
        描述：历史名称变更记录
        输入参数：
            ts_code	str	N	TS代码
            start_date	str	N	公告开始日期
            end_date	str	N	公告结束日期
###############################################################################################################
'''
def namechange(ts_code):
    return pro.namechange(ts_code=ts_code, fields='ts_code,name,start_date,end_date,change_reason')


'''
###############################################################################################################
    IPO新股列表:
        接口：new_share
        描述：获取新股上市列表数据
        限量：单次最大2000条，总量不限制
        积分：用户需要至少120积分才可以调取，具体请参阅积分获取办法
        输入参数：
            start_date	str	N	上网发行开始日期
            end_date	str	N	上网发行结束日期
###############################################################################################################
'''
def new_share():
    return pro.new_share()